Repository: Archanciel/audiolearn
Catalog: lib/l10n/app_*.arb
Languages: fr

# fromMp3ZipFileUsedToRestoreMultiplePlaylists
source: from the multiple playlists MP3 zip file "{zipFilePathNName}"
fr: playlist(s) à partir du fichier zip MP3 de playlists multiples "{zipFilePathNName}"

# confirmMp3RestorationFromMp3Zip
source: Restored {audioNNumber} audio(s) MP3 in {playlistsNumber} playlist(s) {secondMsgPart}.
fr: Restauré {audioNNumber} audio(s) MP3 dans {playlistsNumber} {secondMsgPart}.

# restorePlaylistTitlesOrderTitle
source: Playlist Titles Order Restoration
fr: Restauration de l'ordre des titres de playlist

# restorePlaylistTitlesOrderMessage
source: A previous playlist titles order file is available in the selected playlist root path. Do you want to restore this saved order or keep the current playlist titles order? Click on "Confirm" to restore the saved order or on "Cancel" to keep the current order.
fr: Un fichier d'ordre des titres de playlist précédent est disponible dans le chemin racine de playlist sélectionné. Voulez-vous restaurer cet ordre sauvegardé précédemment ou conserver l'ordre actuel des titres de playlist ? Cliquez sur "Confirmer" pour restaurer l'ordre sauvegardé ou sur "Annuler" pour conserver l'ordre actuel.

# newPlaylistsAddedAtEndOfPlaylistLst
source: The created playlists are positioned at the end of the playlist list.
fr: Les playlists créées sont ajoutées à la fin de la liste des playlists.

# uniquePlaylistAddedAtEndOfPlaylistLst
source: Since the playlist was created, it is positioned at the end of the playlist list.
fr: Puisque la playlist "{addedPlaylistTitles}" a été créée, elle est positionnée à la fin de la liste des playlists.

# playlistsSaveDialogTitle
source: Playlists Backup to ZIP
fr: Sauvegarde des playlists

# playlistsSaveExplanation
source: Checking the "Add all JPG pictures to ZIP" checkbox will add all the application audio pictures to the created ZIP. This is only useful if the ZIP file will be used to restore another application.
fr: En cochant la case "Ajouter toutes les photos JPG", toutes les photos audio de l'application seront ajoutées au fichier ZIP créé. Cela n'est utile que si le fichier ZIP doit servir à restaurer une autre application.

# addPictureJpgFilesToZip
source: Add all JPG pictures to ZIP
fr: Ajouter toutes les photos JPG

# confirmAudioFromPlaylistDeletionTitle
source: Confirm deletion of the audio "{audioTitle}" from the Youtube playlist
fr: Confirmez la suppression de l'audio "{audioTitle}" de la playlist Youtube

# confirmAudioFromPlaylistDeletion
source: Delete the audio "{audioTitle}" from the playlist "{playlistTitle}" defined on the Youtube site, otherwise the audio will be downloaded again during the next playlist download. Or click on "Cancel" and choose "Delete Audio ..." instead of "Delete Audio from Playlist as well ...". So, the audio will be removed from the playable audio list, but will remain in the downloaded audio list, which will prevent its re-download.
fr: Supprimez l'audio "{audioTitle}" de la playlist "{playlistTitle}" définie sur le site Youtube, sinon l'audio sera téléchargé à nouveau lors du prochain téléchargement de la playlist. Ou alors cliquez sur "Annuler" et choisissez "Supprimer l'audio ..." au lieu de "Supprimer l'audio de la playlist également ...". Ainsi, l'audio sera supprimé de la liste des audio's jouables, mais restera dans la liste des audio's téléchargés, ce qui évitera son re-téléchargement.
