Repository: Archanciel/audiolearn
Catalog: lib/l10n/app_*.arb
Languages: fr

# audioDownloadFromDateTimeAllPlaylistsTooltip
source: Since the current date/time value corresponds to the application oldest date/time downladed audio value, if the date/time is not modified, all the application audio MP3 files will be included in the ZIP file.
fr: Puisque la valeur de date/heure actuelle correspond à la valeur de date/heure de l'audio téléchargé le plus ancien de l'application, si la date/heure n'est pas modifiée, tous les fichiers audio MP3 de l'application seront inclus dans le fichier ZIP.

# audioDownloadFromDateTimeSinglePlaylistTooltip
source: Since the current date/time value corresponds to the playlist oldest date/time downladed audio value, if the date/time is not modified, all the playlist audio MP3 files will be included in the ZIP file.
fr: Puisque la valeur de date/heure actuelle correspond à la valeur de date/heure de l'audio téléchargé le plus ancien de la playlist, si la date/heure n'est pas modifiée, tous les fichiers audio MP3 de la playlist seront inclus dans le fichier ZIP.

# noAudioMp3WereSavedToZip
source: No audio MP3 file was saved to ZIP since no audio was downloaded on or after {audioDownloadFromDateTime}.
fr: Aucun fichier audio MP3 n'a été sauvegardé dans un fichier ZIP du fait qu'aucun audio n'a été téléchargé à partir du {audioDownloadFromDateTime}.

# savePlaylistAudioMp3FilesToZipMenu
source: Save the Playlist Audio's MP3 to 1 or n ZIP File(s) ...
fr: Sauver les audio's MP3 de la playlist dans 1 ou n fichier(s) ZIP ...

# savePlaylistAudioMp3FilesToZipTooltip
source: Saving the playlist audio MP3 files to one or several ZIP file(s). You can specify a date/time filter to only include audio files downloaded on or after that date.
fr: Sauvegarde les fichiers audio MP3 de la playlist dans un ou plusieurs fichier(s) ZIP. Vous pouvez spécifier un filtre de date/heure pour n'inclure que les fichiers audio téléchargés à partir de cette date.

# audioDownloadFromDateTimeUniquePlaylistExplanation
source: The default specified download date corresponds to the oldest audio download date from the playlist. Modify this value by specifying the download date from which the audio MP3 files will be included in the ZIP.
fr: La date de téléchargement spécifiée par défaut correspond à la date de téléchargement audio la plus ancienne de la playlist. Modifiez cette valeur en spécifiant la date de téléchargement à partir de laquelle les fichiers audio MP3 seront inclus dans le fichier ZIP.

# audioDownloadFromDateTimeUniquePlaylistTooltip
source: Since the current date/time value corresponds to the playlist oldest date/time downladed audio value, if the date/time is not modified, all the playlist audio MP3 files will be included in the ZIP file.
fr: Puisque la valeur de date/heure actuelle correspond à la valeur de date/heure de l'audio téléchargé le plus ancien de la playlist, si la date/heure n'est pas modifiée, tous les fichiers audio MP3 de la playlist seront inclus dans le fichier ZIP.

# invalidDateFormatErrorMessage
source: {dateStr} does not respect the date or date/time format.
fr: {dateStr} ne respecte pas le format date ou date heure:minute.

# savingUniquePlaylistAudioMp3
source: Saving {playlistTitle} audio files to ZIP ...
fr: Sauvegarde des fichiers audio de la playlist {playlistTitle} ...

# savingMultiplePlaylistsAudioMp3
source: Saving multiple playlists audio files to ZIP ...
fr: Sauvegarde des fichiers audio de multiples playlists ...

# savingApproximativeTime
source: Should approxim. take {saveTime}. ZIP number: {zipNumber}
fr: Peut prendre approxim. {saveTime}. Nb ZIP: {zipNumber}

# savingUpToHalfHour
source: Please wait, this may take 10 to 30 minutes or more ...
fr: Patience, cela peut prendre 10 à 30 minutes, voir plus ...

# savingAudioToZipTime
source: Saving the audio MP3 files will take this estimated duration (hh:mm:ss): {evaluatedSaveTime}.
fr: La sauvegarde des fichiers audio MP3 dans un ou plusieurs fichiers ZIP va nécessiter cette durée estimée (hh:mm:ss): {evaluatedSaveTime}.

# savingAudioToZipTimeTitle
source: Prevision of the Save Duration
fr: Estimation de la durée de sauvegarde

# correctedSavedUniquePlaylistAudioMp3ToZip
source: Saved to ZIP file(s) unique playlist audio MP3 files downloaded from {audioDownloadFromDateTime}. Total saved audio number: {savedAudioNumber}, total size: {savedAudioTotalFileSize} and total duration: {savedAudioTotalDuration}. Save operation real duration: {saveOperationRealDuration}, number of bytes saved per second: {bytesNumberSavedPerSecond}, number of created ZIP file(s): {zipFilesNumber}. ZIP file path name: "{filePathName}".{zipTooLargeFileInfo}
fr: Enregistré dans des ZIP's tous les fichiers audio MP3 de la playlist unique téléchargés depuis le {audioDownloadFromDateTime}. Nombre total d'audios sauvegardés: {savedAudioNumber}, taille totale: {savedAudioTotalFileSize} et durée totale: {savedAudioTotalDuration}. Durée réelle de l'opération de sauvegarde: {saveOperationRealDuration}, nombre de bytes sauvés par seconde: {bytesNumberSavedPerSecond}, nombre de fichier(s) ZIP créé(s): {zipFilesNumber}. Fichier ZIP: "{filePathName}".{zipTooLargeFileInfo}

# correctedSavedMultiplePlaylistsAudioMp3ToZip
source: Saved to ZIP all playlists audio MP3 files downloaded from {audioDownloadFromDateTime}. Total saved audio number: {savedAudioNumber}, total size: {savedAudioTotalFileSize} and total duration: {savedAudioTotalDuration}. Save operation real duration: {saveOperationRealDuration}, number of bytes saved per second: {bytesNumberSavedPerSecond}, number of created ZIP file(s): {zipFilesNumber}. ZIP file path name: "{filePathName}".{zipTooLargeFileInfo}
fr: Enregistré dans des ZIP's tous les fichiers audio MP3 des playlists téléchargés depuis le {audioDownloadFromDateTime}. Nombre total d'audios sauvegardés: {savedAudioNumber}, taille totale: {savedAudioTotalFileSize} et durée totale: {savedAudioTotalDuration}. Durée réelle de l'opération de sauvegarde: {saveOperationRealDuration}, nombre de bytes sauvés par seconde: {bytesNumberSavedPerSecond}, nombre de fichier(s) ZIP créé(s): {zipFilesNumber}. Fichier ZIP: "{filePathName}"{zipTooLargeFileInfo}

# restorePlaylistsAudioMp3FilesFromZipMenu
source: Restore Playlists Audio's MP3 from ZIP File ...
fr: Restaurer les audio's MP3 des playlists depuis un ou plusieurs fichier(s) ZIP ...

# restorePlaylistsAudioMp3FilesFromZipTooltip
source: Restoring audio's MP3 not yet present in the playlists from a saved ZIP file. Only the MP3 relative to the audio's listed in the playlists are restorable.
fr: Restaure les audio's MP3 des playlists à partir d'un fichier ZIP préalablement sauvé. Seuls les fichiers MP3 qui correspondent aux audio's listés dans les playlists et qui ne sont pas déjà présents dans ces playlists sont restaurés.

# audioMp3RestorationDialogTitle
source: MP3 Restoration
fr: Restauration des MP3

# audioMp3RestorationExplanation
source: Only the MP3 relative to the audio's listed in the playlists which are not already present in the playlists are restorable.
fr: Seuls les fichiers MP3 qui correspondent aux audio's listés dans les playlists et qui ne sont pas déjà présents dans les playlists sont restaurés.

# restorePlaylistAudioMp3FilesFromZipMenu
source: Restore Playlist Audio's MP3 from ZIP File ...
fr: Restaurer les audio's MP3 de la playlist depuis un ou plusieurs fichier(s) ZIP ...

# restorePlaylistAudioMp3FilesFromZipTooltip
source: Restoring audio's MP3 not yet present in the playlist from a saved ZIP file. Only the MP3 relative to the audio's listed in the playlist are restorable.
fr: Restaure les audio's MP3 de la playlist à partir d'un fichier ZIP préalablement sauvé. Seuls les fichiers MP3 qui correspondent aux audio's listés dans la playlist et qui ne sont pas déjà présents dans cette playlist sont restaurés.

# audioMp3UniquePlaylistRestorationDialogTitle
source: MP3 Restoration
fr: Restauration des MP3

# audioMp3UniquePlaylistRestorationExplanation
source: Only the MP3 relative to the audio's listed in the playlist which are not already present in the playlist are restorable.
fr: Seuls les fichiers MP3 qui correspondent aux audio's listés dans la playlist et qui ne sont pas déjà présents dans cette playlist sont restaurés.

# playlistInvalidRootPathWarning
source: The defined path "{playlistRootPath}" is invalid since the playlists final dir name '{wrongName}' is not equal to 'playlists'. Please define a valid playlist directory and retry changing the playlists root path.
fr: Le répertoire défini "{playlistRootPath}" est invalide du fait que le nom du répertoire final '{wrongName}' devant contenir les playlists est différent de 'playlists'. Veuillez renommer le nouveau répertoire contenant les playlists et rééffectuer son changement

# restoringUniquePlaylistAudioMp3
source: Restoring {playlistTitle} audio files from ZIP ...
fr: Restoration des fichiers audio de la playlist {playlistTitle} ...

# playlistsMp3RestorationHelpTitle
source: Playlists Mp3 Restoration Function
fr: Fonction de restauration MP3 des playlists

# playlistsMp3RestorationHelpContent
source: This function is useful in the situation where playlists were restored from a ZIP file which only contained the playlists, comments and pictures JSON files and so did not contain the audio MP3 files.
fr: Cette fonction est utile dans la situation où les playlists ont été restaurées depuis un fichier ZIP qui ne contenait que les fichiers JSON des playlists, des commentaires et des photos et donc ne contenait pas les fichiers audio MP3.

# uniquePlaylistMp3RestorationHelpTitle
source: Playlist Mp3 Restoration Function
fr: Fonction de restauration MP3 de la playlist

# uniquePlaylistMp3RestorationHelpContent
source: This function is useful in the situation where the playlist was restored from a ZIP file which only contained the playlist, comments and pictures JSON files and so did not contain the audio MP3 files.
fr: Cette fonction est utile dans la situation où la playlist a été restaurée depuis un fichier ZIP qui ne contenait que les fichiers JSON de la playlist, des commentaires et des photos et donc ne contenait pas les fichiers audio MP3.

# playlistsMp3SaveHelpTitle
source: Playlists Mp3 Save Function
fr: Fonction de sauvegarde MP3 des playlists

# playlistsMp3SaveHelpContent
source: If you already executed this save MP3 functionality a couple of weeks ago, the following example will help you to understand the result of the new save playlists MP3 execution. Consider that the first created MP3 saved ZIP is named audioLearn_mp3_from_2023-05-17_07_03_50_on_2025-06-15_11_59_38.zip. Now, on {dateOne} at 10:00 you do a new playlist MP3 backup with setting the oldest audio download date to {dateTwo}, i.e. the date on which the previous MP3 ZIP file was created. But if the newly created ZIP file is named audioLearn_mp3_from_2025-06-20_09_25_34_on_2025-07-27_16_23_32.zip and not audioLearn_mp3_from_2025-06-15_on_2025-07-27_16_23_32.zip, the reason is that the oldest downloaded audio after {dateTwo} was downloaded on {dateThree} 09:25:34.
fr: Si vous avez déjà exécuté cette fonctionnalité de sauvegarde MP3 il y a quelques semaines, l'exemple suivant vous aidera à comprendre le résultat de la nouvelle exécution de sauvegarde MP3 des playlists. Considérez que le premier fichier ZIP MP3 sauvegardé est nommé audioLearn_mp3_from_2023-05-17_07_03_50_on_2025-06-15_11_59_38.zip. Maintenant, le {dateOne} à 10:00 vous effectuez une nouvelle sauvegarde MP3 des playlists en définissant la date de téléchargement audio la plus ancienne au {dateTwo}, c'est-à-dire la date à laquelle le fichier ZIP MP3 précédent a été créé. Mais si le fichier ZIP nouvellement créé est nommé audioLearn_mp3_from_2025-06-20_09_25_34_on_2025-07-27_16_23_32.zip et non audioLearn_mp3_from_2025-06-15_on_2025-07-27_16_23_32.zip, la raison est que l'audio téléchargé le plus ancien après le {dateTwo} a été téléchargé le {dateThree} 09:25:34.

# uniquePlaylistMp3SaveHelpTitle
source: Playlist Mp3 Save Function
fr: Fonction de sauvegarde MP3 de la playlist

# uniquePlaylistMp3SaveHelpContent
source: If you already executed this save MP3 functionality a couple of weeks ago, the following example will help you to understand the result of the new save playlist MP3 execution. Consider that the first created MP3 saved ZIP is named audioLearn_mp3_from_2023-05-17_07_03_50_on_2025-06-15_11_59_38.zip. Now, on {dateOne} at 10:00 you do a new playlist MP3 backup with setting the oldest audio download date to {dateTwo}, i.e. the date on which the previous MP3 ZIP file was created. But if the newly created ZIP file is named audioLearn_mp3_from_2025-06-20_09_25_34_on_2025-07-27_16_23_32.zip and not audioLearn_mp3_from_2025-06-15_on_2025-07-27_16_23_32.zip, the reason is that the oldest downloaded audio after {dateTwo} was downloaded on {dateThree} 09:25:34.
fr: Si vous avez déjà exécuté cette fonctionnalité de sauvegarde MP3 il y a quelques semaines, l'exemple suivant vous aidera à comprendre le résultat de la nouvelle exécution de sauvegarde MP3 de la playlist. Considérez que le premier fichier ZIP MP3 sauvegardé est nommé audioLearn_mp3_from_2023-05-17_07_03_50_on_2025-06-15_11_59_38.zip. Maintenant, le {dateOne} à 10:00 vous effectuez une nouvelle sauvegarde MP3 de la playlist en définissant la date de téléchargement audio la plus ancienne au {dateTwo}, c'est-à-dire la date à laquelle le fichier ZIP MP3 précédent a été créé. Mais si le fichier ZIP nouvellement créé est nommé audioLearn_mp3_from_2025-06-20_09_25_34_on_2025-07-27_16_23_32.zip et non audioLearn_mp3_from_2025-06-15_on_2025-07-27_16_23_32.zip, la raison est que l'audio téléchargé le plus ancien après le {dateTwo} a été téléchargé le {dateThree} 09:25:34.

# insufficientStorageSpace
source: Insufficient storage space detected when selecting the ZIP file containing MP3's.
fr: Espace de stockage insuffisant détecté lors de la sélection du fichier ZIP contenant les MP3's.

# pathError
source: Failed to retrieve file path.
fr: Échec de la récupération du chemin de fichier.

# androidStorageAccessErrorMessage
source: Could not access Android external storage.
fr: Impossible d'accéder au stockage externe Android.

# zipTooLargeFileInfoLabel
source: Those files are too large to be included in the MP3 saved ZIP file and so were not saved:
fr: Ces fichiers sont trop volumineux pour être inclus dans les fichiers ZIP MP3 et n'ont donc pas été sauvegardés:

# mp3ZipFileSizeLimitInMbLabel
source: ZIP file size limit in MB
fr: Taille maximale en Mo des fichiers ZIP

# mp3ZipFileSizeLimitInMbTooltip
source: Maximum size in MB for each ZIP file when saving audio MP3 files. On Android devices, if this limit is set too high, the save operation will fail due to memory constraints. Multiple ZIP files will be created automatically if the total content exceeds this limit.
fr: Taille maximale en Mo pour chaque fichier ZIP lors de la sauvegarde des fichiers audio MP3. Sur les appareils Android, si cette limite est trop élevée, l'opération de sauvegarde échouera en raison de contraintes de mémoire. Plusieurs fichiers ZIP seront créés automatiquement si le contenu total dépasse cette limite.

# zipTooLargeOneFileInfoLabel
source: This file is too large to be included in the MP3 saved ZIP file and so was not saved:
fr: Ce fichier est trop volumineux pour être inclu dans un fichier ZIP MP3 et n'a donc pas été sauvegardé:

# androidZipFileCreationError
source: Error saving the ZIP file {zipFileName}. This is due to its too large size: {zipFileSize}. Solution: in the application settings, reduce the maximum ZIP file size and re-run the save MP3 to ZIP function.
fr: Erreur lors de la sauvegarde du fichier ZIP {zipFileName}. Ceci est dû à sa taille trop importante: {zipFileSize}. Solution: dans les paramètres de l'application, réduisez la taille maximale des fichiers ZIP et réexécutez la sauvegarde des MP3 dans des fichiers ZIP.

# obtainMostRecentAudioDownloadDateTimeMenu
source: Get latest Audio download Date
fr: Obtenir la date de téléchargement audio la plus récente

# obtainMostRecentAudioDownloadDateTimeTooltip
source: Finds the most recent audio download date across all playlists. Use this date when creating ZIP backups with the 'Save Playlists Audio's MP3 to ZIP File(s)' menu to ensure you capture only the newest audio files for restoring them to the current app version.
fr: Trouve la date de téléchargement audio la plus récente parmi toutes les playlists. Utilisez cette date lors de la création de sauvegardes ZIP avec le menu 'Sauver les audio's MP3 des playlists dans des fichiers ZIP' pour ne capturer que les fichiers audio les plus récents afin de les restaurer dans cette version de l'application.

# displayNewestAudioDownloadDateTimeTitle
source: Latest Audio Download Date
fr: Date récente de téléchargement audio

# displayNewestAudioDownloadDateTime
source: This is the latest audio download date/time: {newestAudioDownloadDateTime}.
fr: Ceci est la date/heure de téléchargement audio la plus récente: {newestAudioDownloadDateTime}.

# audioTitleModificationHelpTitle
source: Using Audio Title Modification
fr: Utilisation de la modification du titre de l'audio

# audioTitleModificationHelpContent
source: For example, if in a playlist we have three audios that were downloaded in this order: last first second and we want to listen to them in order according to their title, it is useful to rename the titles this way: 3-last 1-first 2-second Then you need to click on the "Sort/Filter Audio ..." menu to define a sort that you name and that sorts the audio's according to their title. Once the "Sort and Filter Parameters" dialog is open, define the filter name in the "Save as:" field and open the "Sort by:" list. Select "Audio title" and then remove "Audio downl date". Finally, click on "Save". Once this sort is defined, check that it is selected and use the "Save Sort/Filter Parameters to Playlist ..." menu by selecting the screen for which the sort will be applied. This way, the audios will be played in the order in which you want to listen to them.
fr: Par exemple, si dans une playlist on dispose de trois audio's qui ont été téléchargés dans cet ordre: dernier premier deuxième et que l'on souhaite écouter dans l'ordre en rapport avec leur titre, il est utile de renommer les titres de cette manière: 3-dernier 1-premier 2-deuxième Ensuite il faut cliquer sur le menu "Trier/filtrer audio ..." afin de définir un tri que l'on nomme et qui trie les audios selon leur titre. Une fois le dialogue "Paramètres tri et filtre" ouvert, définir le nom du filtre dans le champ "Enregistrer sous:" et ouvrir la liste "Trier par:". Sélectionner "Titre audio" et ensuite supprimer "Date téléch audio". Enfin, cliquer sur "Sauver". Une fois que ce tri est défini, on vérifie qu'il est sélectionné et l'on utilise le menu "Sauvegarder les paramètres tri/filtre dans la playlist ..." en sélectionnant l'écran pour lequel le tri sera appliqué. Ainsi, les audios seront joués dans l'ordre dans lequel on souhaite les écouter.

# playlistConvertTextToAudioMenu
source: Convert Text to Audio ...
fr: Convertir un texte en audio ...

# playlistConvertTextToAudioMenuTooltip
source: Convert a text to a listenable audio which is added to the playlist. Adding positionned comments or a picture to this audio will be possible like for the other audio's.
fr: Convertir un texte en audio écoutable qui est ajouté à la playlist. Comme pour les autres audio's, il sera possible d'ajouter des commentaires positionnés ou une image à cet audio.

# convertTextToAudioDialogTitle
source: Convert Text to Audio
fr: Convertir le texte en audio

# textToConvert
source: Text to convert, {brace_1} = silence
fr: Texte à convertir, {brace_1} = silence

# textToConvertTextFieldTooltip
source: Enter the text to convert an audio added to the playlist. The audio is created using the selected voice. Add one or several brace(s) to include one or several second(s) of silence at this position.
fr: Entrer le texte à convertir en un audio ajouté à la playlist. L'audio est généré en utilisant la voix sélectionée. Insérer une ou plusieures accolade(s) afin d'ajouter à cet endroit une ou plusieures seconde(s) de silence.

# textToConvertTextFieldHint
source: Enter your text here ...
fr: Entrez votre texte ici ...

# conversionVoiceSelection
source: Voice selection:
fr: Sélection de la voix:

# femineVoice
source: feminine
fr: féminine

# listenTextButton
source: Listen
fr: Écouter

# listenTextButtonTooltip
source: Listening the text to convert with the selected voice.
fr: Écoute du texte à convertir avec la voix sélectionnée.

# createAudioFileButton
source: Create MP3
fr: Créer MP3

# createAudioFileButtonTooltip
source: Create the audio file using the selected voice and add it to the playlist.
fr: Création du fichier audio en utilisant la voix sélectionnée et ajout de l'audio à la playlist.

# stopListeningTextButton
source: Stop
fr: Stopper

# stopListeningTextButtonTooltip
source: Stop listening the text using the selected voice.
fr: Arrêter la lecture utilisant la voix sélectionnée.

source: MP3 File Name
fr: Nom du fichier MP3

# enterMp3FileName
source: Enter the MP3 file name
fr: Entrer le nom du fichier MP3

# myMp3FileName
source: file name
fr: nom de fichier

source: Create MP3
fr: Créer MP3

# audioImportedFromTextToSpeechToLocalPlaylist
source: The audio created by the text to MP3 conversion {importedAudioFileNames} was added to local playlist "{toPlaylistTitle}".
fr: L'audio créé par la conversion de texte en MP3 {importedAudioFileNames} a été {replacedOrAdded} la playlist locale "{toPlaylistTitle}".

# audioImportedFromTextToSpeechToYoutubePlaylist
source: The audio created by the text to MP3 conversion {importedAudioFileNames} was added to Youtube playlist "{toPlaylistTitle}".
fr: L'audio créé par la conversion de texte en MP3 {importedAudioFileNames} a été {replacedOrAdded} la playlist Youtube "{toPlaylistTitle}".

# replaceExistingAudioInPlaylist
source: The file "{fileName}.mp3" already exists in the playlist "{playlistTitle}". If you want to replace it with the new version, click on the "Confirm" button. Otherwise, click on the "Cancel" button and you will be able to define a different file name.
fr: Le fichier "{fileName}.mp3" existe déjà dans la playlist "{playlistTitle}". Si vous voulez le remplacer par la nouvelle version, cliquez sur le bouton "Confirmer". Sinon, cliquez sur le bouton "Annuler" et vous pourrez définir un nom de fichier différent.

# speech
source: Text
fr: Paroles

# convertTextToAudioHelpTitle
source: How to use the {brace_1} character
fr: Utilisation du caractère {brace_1} qui ajoute 1 seconde de silence

# convertTextToAudioHelpContent
source: {brace_1}A text with a character that introduces a 1-second silence. At the beginning of the text, 2 seconds of silence are added. {brace_2} Before this sentence, 4 seconds of silence are introduced. {brace_3} Here, one second of silence. This character was chosen because it is not normally used in writing.
fr: {brace_1}Un texte avec un caractère qui introduit un silence de 1 seconde. Au dàbut du texte, 2 secondes de silence sont ajoutées. {brace_2} Avant cette phrase, 4 secondes de silence sont introduites. {brace_3} Ici, une seconde de silence. Ce caractère a été choisi du fait qu'il n'est pas normalement utilisé dans les écritures.

# textToSpeech
source: converted
fr: converti

# audioTextToSpeechInfoDialogTitle
source: Converted Audio Info
fr: Informations sur l'audio converti

# convertedAudioDateTimeLabel
source: Converted text first date time
fr: Date//heure prem conversion

# fromMp3ZipFileUsedToRestoreUniquePlaylist
source: from the unique playlist MP3 zip file "{zipFilePathNName}"
fr: playlist(s) à partir du fichier zip MP3 "{zipFilePathNName}"
